app/controllers/posts_controller.rb

  def index
    @posts = Post.paginate(:page => params[:page], :per_page => 5).includes(:photos, :user, :likes).
      order("created_at desc")
---
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 1], ["post_id", 1], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "photos".* FROM "photos" WHERE "photos"."post_id" IN (2, 1)
SELECT "users".* FROM "users" WHERE "users"."id" IN (2, 1)

  def create
    @post = current_user.posts.build(post_params)
    if @post.save
      if params[:images]
        params[:images].each do |img|
          @post.photos.create(image: params[:images][img])
---
INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", ""], ["user_id", 1], ["created_at", "2018-12-18 15:20:08.308250"], ["updated_at", "2018-12-18 15:20:08.308250"]]
INSERT INTO "photos" ("image", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["image", "n7mxemv8n5gsdvbu76f9.png"], ["post_id", 1], ["created_at", "2018-12-18 15:20:08.357162"], ["updated_at", "2018-12-18 15:20:08.357162"]]

  def show
    @photos = @post.photos
    @likes = @post.likes.includes(:user)
---
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 1], ["post_id", 2], ["LIMIT", 1]]
SELECT  "photos".* FROM "photos" WHERE "photos"."post_id" = ? ORDER BY "photos"."id" ASC LIMIT ?  [["post_id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" IN (1, 2)

  def destroy
    if @post.user == current_user
      if @post.destroy
---
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 2]]

  def find_post
    @post = Post.find_by id: params[:id]
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]