app/controllers/users_controller.rb

  def index
    @users = User.search(params[:term])
---
SELECT "users".* FROM "users" WHERE (name LIKE '%h%')

  def show
    @user = User.find(params[:id])
    @posts = @user.posts.includes(:photos)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "photos".* FROM "photos" WHERE "photos"."post_id" = ? ORDER BY "photos"."id" ASC LIMIT ?  [["post_id", 2], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" INNER JOIN "bookmarks" ON "bookmarks"."post_id" = "posts"."id" WHERE "posts"."user_id" = ?  [["user_id", 1]]